# Brew Taps (Third-Party Repositories)
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"

# Brew CLI
brew "ansible"
brew "awscli"
brew "git"
brew "gh"
brew "hashicorp/tap/terraform"
brew "imagemagick"
brew "jq"
brew "kind"
brew "kubernetes-cli"
brew "speedtest-cli"
brew "starship"
brew "terragrunt"
brew "tree"
brew "wget"

# Brew Cask (GUI)
cask "alfred"
cask "ankerwork"
cask "anki"
cask "betterdisplay"
cask "crystalfetch"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "enpass"
cask "font-fira-code-nerd-font"
cask "google-chrome"
cask "google-drive"
cask "hiddenbar"
cask "iina"
cask "obsidian"
cask "onyx"
cask "motrix"
cask "postman"
cask "rectangle"
cask "shottr"
cask "the-unarchiver"
cask "tomatobar"
cask "utm"
cask "visual-studio-code"
cask "warp"
cask "whatsapp"

# VSCode Extensions
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "hashicorp.terraform"
vscode "mhutchie.git-graph"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"